{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [200, 1], "name": "dense/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense/bias"}, {"dtype": "float32", "shape": [5, 800], "name": "lstm/lstm_cell/kernel"}, {"dtype": "float32", "shape": [200, 800], "name": "lstm/lstm_cell/recurrent_kernel"}, {"dtype": "float32", "shape": [800], "name": "lstm/lstm_cell/bias"}]}], "modelTopology": {"training_config": {"metrics": null, "loss": "mse", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "loss_weights": null}, "keras_version": "2.4.0", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 5000, 5], "name": "lstm_input", "sparse": false}}, {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "batch_input_shape": [null, 5000, 5], "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "relu", "stateful": false, "dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "name": "lstm", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.5.0", "format": "layers-model"}